Config/InformationRegisters/OrderAttachments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OrderAttachments</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ExtFile</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ExtFilePreview</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FileLastChangeTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FileLoadTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FileName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Order</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Order</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/OrderAttachments/Ext/RecordSetModule.bsl
#Region EventHandlers

// -----------------------------------------------------------------------------
Procedure BeforeWrite(pCancel, pReplacing)
	If DataExchange.Load Then
		Return;
	EndIf;
	For Each vRecRow In ThisObject Do
		If Not ValueIsFilled(vRecRow.Author) Then
			vRecRow.Author = SessionParameters.CurrentUser;
		EndIf;
		vFileExtension = lower(Right(TrimAll(vRecRow.FileName), 4));
		If vFileExtension = ".jpg" Or vFileExtension = ".jpeg" Then
			vRecRow.ExtFilePreview = vRecRow.ExtFile;
		ElsIf vFileExtension = ".pdf" Then
			vPath = cmConvertPDFtoJPG(vRecRow.ExtFile, vRecRow.FileName);
			If vPath <> Undefined Then
				vBinary = GetFromTempStorage(vPath);
				vRecRow.ExtFilePreview = New ValueStorage(vBinary);
			EndIf;
		EndIf;
	EndDo;
EndProcedure // BeforeWrite

#EndRegion
